/*
 * Сортировка выбором. Дана последовательность чисел n: a1<=a2<=...<=an. Требуется переставить элементы так,
 * чтобы они были расположены по убыванию. Для этого в массиве, начиная с первого, выбирается наибольший
 * элемент и ставится на первое место, а первый - на место наибольшего. Затем, начиная со второго, эта процедура
 * повторяется. Написать алгоритм сортировки выбором.
 */
package jo_2_algorithmisation;

public class OneDimensionSortingTask3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
