/*
 * Сортировка Шелла. Дан массив n действительных чисел. Требуется упорядочить его по возрастанию.
 * Делается это следующим образом: сравниваются два соседних элемента ai, ai+1. Если ai <= ai+1, то продвигаются
 * на один элемент вперед. Если ai > ai+1, то производится перестановка и сдвигаются на один элемент назад.
 * Составить алгоритм этой сортировки.
 */
package jo_2_algorithmisation;

public class OneDimensionSortingTask6 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
